app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "entries"]]
---
  def show
    render (:json => Feed.find(params[:id]), :include => :latest_entries)